---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.FenceType
source: html/61563e0a-b479-729c-95c9-a7cc387884d0.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.FenceType Property

Type of diagram fence visualization.

## Syntax (C#)
```csharp
public AnalysisDisplayStyleDiagramFenceType FenceType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration